wisteria-1c/Конфигурация/InformationRegisters/КодыТоваровSKU.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КодыТоваровSKU</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/КодыТоваровSKU/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступностьРаботыСКодамиТоваровSKU = Истина;
	
	Если Параметры.Свойство("Номенклатура") Тогда 
		Номенклатура = Параметры.Номенклатура;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Номенклатура",
			Параметры.Номенклатура);
		
		Элементы.Список.ТолькоПросмотр = НЕ ДоступностьРаботыСКодамиТоваровSKU;
	Иначе
		
		Элементы.ФормаСоздатьКодыSKU.Видимость = Ложь;
	КонецЕсли;
	
	АдаптацияТакси();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьКодыSKU(Команда)
	
	Если ДоступностьРаботыСКодамиТоваровSKU Тогда
		
		ЗаполнитьАвтоматическиКодыSKU();
		Элементы.Список.Обновить();
		
	Иначе
		
		ПоказатьПредупреждение(,НСтр("ru = 'Создание и удаление SKU осуществляется в главном узле РИБ'"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьАвтоматическиКодыSKU()
	
	ЗакончилисьSKU = Ложь;
	РегистрыСведений.КодыТоваровSKU.СоздатьSKU(Номенклатура, ЗакончилисьSKU);
	
	Если ЗакончилисьSKU Тогда
		
		ТекстСообщения = НСтр("ru = 'В процессе заполнения закончились доступные SKU коды товара. Операция завершена не полностью.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	Если ЭтоИнтерфейсТакси Тогда
		КнопкаНайти = Элементы.Найти("ФормаНайти");
		Если КнопкаНайти <> Неопределено Тогда
			Элементы.Переместить(Элементы.ФормаСоздатьКодыSKU, КоманднаяПанель, КнопкаНайти);
		Иначе
			Элементы.Переместить(Элементы.ФормаСоздатьКодыSKU, КоманднаяПанель);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
